BOQ/src/Catalogs/ГруппыДоступа/ГруппыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыДоступа</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Администратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <comment>Только для персональных групп доступа</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Профиль</name>
    <type>
      <types>CatalogRef.ПрофилиГруппДоступа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователей</name>
    <comment>В качестве типа используется пустая ссылка</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.ГруппыПользователей</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BOQ/src/Catalogs/ГруппыДоступа/Forms/Элемент/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Процедура начальноеЗаполнение ()
	
	Объект.Администратор = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПользователя ( Команда )
	
	п = Новый Структура;
	п.Вставить ( "РежимВыбора", Истина );
	п.Вставить ( "ЗакрыватьПриВыборе", Ложь );
	ОткрытьФорму ( "Справочник.Пользователи.Форма.Выбор", п, Элементы.Пользователи );
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиОбработкаВыбора ( Элемент, ВыбранноеЗначение, СтандартнаяОбработка )
	
	Если ТипЗнч ( ВыбранноеЗначение ) = Тип ( "Массив" ) Тогда
		Для Каждого Значение Из ВыбранноеЗначение Цикл
			обработкаВыбораПользователя ( Значение );
		КонецЦикла;
	Иначе
		обработкаВыбораПользователя ( ВыбранноеЗначение );
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура обработкаВыбораПользователя ( ВыбранноеЗначение )
	
	Если ТипЗнч ( ВыбранноеЗначение ) = Тип ( "СправочникСсылка.Пользователи" ) Тогда
		Если Объект.Пользователи.НайтиСтроки ( Новый Структура ( "Пользователь", ВыбранноеЗначение ) ).Количество () = 0 Тогда
			Объект.Пользователи.Добавить ().Пользователь = ВыбранноеЗначение;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи ( ПараметрыЗаписи )
	
	Оповестить ( "ЗаписьГруппыДоступа", Новый Структура (), Объект.Ссылка );
	
КонецПроцедуры
